app/views/newsletters/index.html.erb


  <!-- Give yourself (and future programmers some breathing room. Blank lines are free! -->

  <h4><%= @title %></h4>
  <p>Clink on link to download an issue of Families Matter Newsletter.</p><br>
  <table class="table">
    <thead>
      <tr>
        <th>Name</th>
        <th>Download Link</th>
        <th>&nbsp;</th>
=======
<% if !flash[:notice].blank? %>
  <div class="alert-info">
  <%= flash[:notice] %>
  </div>
<% end %>
<br>
<h4><%= @title %></h4>
<p>Clink on link to download an issue of Families Matter Newsletter.</p><br>
<table class="table">
  <thead>
---
SELECT "newsletters".* FROM "newsletters"