app/controllers/newsletters_controller.rb

  def index
    @newsletters = Newsletter.all
---
SELECT "newsletters".* FROM "newsletters"

  def create
    @newsletter = Newsletter.new(newsletter_params)

    if @newsletter.save
---
INSERT INTO "newsletters" ("created_at", "month", "title", "updated_at", "year") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 10 Sep 2014 19:43:26 UTC +00:00], ["month", "test month"], ["title", "test title"], ["updated_at", Wed, 10 Sep 2014 19:43:26 UTC +00:00], ["year", 2014]]

  def destroy
    @newsletter =Newsletter.find(params[:id])
    @newsletter.destroy
---
SELECT "newsletters".* FROM "newsletters" WHERE "newsletters"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "newsletters" WHERE "newsletters"."id" = ?  [["id", 1]]